Repository: lenoryv/collective.spanishdocumentation
Catalog: buildout.coredev/omegat/project_save.tmx
Source language: en_us
Languages: es_ve

source: Anyone with a plone.org account is free to edit.
es_ve: Cualquiera con una cuenta en plone.org es libre de editarlo.

source: Anything like 'except: pass' will likely be reverted instantly
es_ve: Cualquier cosa como 'except: pass' es probable que sea revertido instantáneamente

source: Appears to not actually be the case.
es_ve: Parece no ser en realidad el caso.

source: Are ids and classes used appropriately?
es_ve: ¿Los ids y class CSS utilizado son apropiados?

source: Are there incomplete variations?
es_ve: ¿Hay variaciones incompletas?

source: Are they properly internationalized?
es_ve: ¿Son correctas las internacionalizaciones?

source: As a community, Plone maintains several types of documentation:
es_ve: Como una comunidad, Plone mantienen muchos tipos de documentación:

source: As long as you don't have any pending commits, you just need to remove the package from src/ and it will recheck it out for you when it updates.
es_ve: Mientras usted no tenga cualquier revisión de cambios pendiente, usted solo necesita remover el paquete del directorio src/ y se vuelve a revisar para usted cuando se actualiza.

source: At the base of your buildout, open checkouts.cfg and add your package if it's not already there::
es_ve: En la base de su buildout, abra el archivo checkouts.cfg y añada su paquete si no es ya allí::

source: At the time of writing this document, there are branches for 4.1, 4.2, and master, which is the implied 4.3.
es_ve: Al momento de escribir este documento, habían tres branches para 4.1, 4.2, y master, el cual es implícitamente 4.3.

source: At the very least, your package should include the following forms of documentation:
es_ve: Al menos, su paquete tendría que incluir las siguientes formas de documentación

source: At this point, the feature branch's history has been updated, but it hasn't actually been merged to 4.2 yet.
es_ve: Al llegar a este punto, la historia de la branch característica ha sido actualizada, pero no ha sido de hecho fusionada con la versión 4.2 aún.

source: Branches and Forks and Direct Commits - Oh My!
es_ve: Branches y Forks y Hacer revisiones directamente - ¡Por Dios!

source: Bugs ----
es_ve: Errores -------

source: Buildout Issues ---------------
es_ve: Incidencias Buildout --------------------

source: Buildout can be frustrating for those unfamiliar with parsing through autistic robot language.
es_ve: Buildout puede ser muy frustrante para aquellos no familiarizados con el análisis a través del lenguaje robot autista.

source: Buildout has simply noticed that the version of buildout required by the bootstrap.py file you are trying to run does not match the version of buildout in your python library.
es_ve: Buildout simplemente se ha dado cuenta de que la versión de buildout requerida por el archivo bootstrap.py que usted está intentando ejecutar no coincide con la versión de buildout en la biblioteca de python.

source: Can I get involved other ways at first?
es_ve: ¿Puedo yo involucrarme de otras formas primero?

source: Can't open file '/Startup/run.py' ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Two possible fixes, you are using Python 2.4 by mistake, so use 2.6 instead.
es_ve: No puede abrir el archivo '/Startup/run.py' ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Dos posibles soluciones, usted esta usando Python 2.4 por equivocación, así que por favor use Python 2.6 en cambio.

source: Checking out Packages for Fixing -------------------------------- Most packages are not in src/ by default, so you can user mr.developer to get the latest and make sure you are always up to date.
es_ve: Comprobando Paquetes para corregir ---------------------------------- La mayoría de paquetes no están en el directorio src/ por defecto, así usted que puedes usar mr.developer para conseguir la versión mas reciente y asegurarse que usted siempre tiene la versión mas actualizada.

source: Code Review -----------
es_ve: Revisión de Código ------------------

source: Comb through all the files and delete any lines which say "allow-hosts =" and "allow-hosts +=".
es_ve: registrar minuciosamente todos los archivos y elimine cualquier lineas la cual diga así "allow-hosts =" y "allow-hosts +=".

source: Committing and Pull Requests ---------------------------- Phew!
es_ve: Generando una revisión y haciendo Pull Requests ----------------------------------------------- ¡Uf!

source: Committing to Products.CMFPlone ------------------------------- If you are working a bug fix on Products.CMFPlone, there are a couple other things to take notice of.
es_ve: Generando revisiones al paquete Products.CMFPlone ------------------------------------------------- Si usted esta trabajando un corregir un fallo en el paquete Products.CMFPlone, hay un par de otras cosas que debe tomar en cuenta.

source: Concrete Rules --------------
es_ve: Reglas específicas ------------------

source: Contributing to Plone Core ==========================
es_ve: Contribuyendo al núcleo de Plone ================================

source: Create a buildout configuration file for your plip in the 'plips' folder.
es_ve: Cree una archivo configuración buildout para su plip en la carpeta llamada 'plips'.

source: Creating a New PLIP Branch ^^^^^^^^^^^^^^^^^^^^^^^^^^ ..
es_ve: Creando una nueva Creating Branch PLIP ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ ..

source: Currently, this is just someone else who thinks your PLIP is a good idea, a +1.
es_ve: En la actualidad, sólo alguien más que piensa que su PLIP es una buena idea, un +1.

source: Delete 'mkzopeinstance.py' from bin/ and rerun buildout to correct this if you're finding it irksome.
es_ve: Eliminar el archivo 'mkzopeinstance.py' desde el directorio bin/ y ejecute de nuevo el script buildout para corregir esto si usted está encontrando fastidioso.

source: Dependencies ------------ * `Git <http://help.github.com/mac-set-up-git/>`_ * `Subversion <http://subversion.apache.org/>`_ * `Python <http://python.org/>`_ 2.6 or 2.7 including development headers.
es_ve: Dependencias ------------ * `Git <http://help.github.com/mac-set-up-git/>`_ * `Subversion <http://subversion.apache.org/>`_ * `Python <http://python.org/>`_ 2.6 or 2.7 incluyendo encabezados de desarrollo.

source: Despite the occasional grouch here and there, most plone devs will go out of their way to get you on the right path.
es_ve: A pesar del mal humor ocasional aquí y allá, la mayoría de los desarrolladores de Plone se salen de su camino para ayudarle a que usted consiga la ruta correcta.

source: Developer addresses concerns in feedback and resubmits if necessary.
es_ve: El desarrollador direcciona lo concerniente en al comentario y presenta de nuevo si es necesario.

source: Developer implements PLIP (code, tests, documentation) #.
es_ve: El desarrollador implementa el PLIP (código, tests, documentación) #.

source: Did the migration(s) work?
es_ve: ¿Hizo el trabajo de migración?

source: Dirty Packages ^^^^^^^^^^^^^^
es_ve: Paquetes Sucios ^^^^^^^^^^^^^^^

source: Do one of those, say two hail marys, and re-run bootstrap.
es_ve: De una de esas, digamos dos Ave Marías, con tres padres nuestros y ejecute de nuevo bootstrap.py.

source: Documentation Issues --------------------
es_ve: Incidencias de la documentación -------------------------------

source: Documentation of Plone ----------------------
es_ve: Documentación de Plone ----------------------

source: Documenting a package ---------------------
es_ve: Documentando un paquete -----------------------

source: Does their role assignment make sense?
es_ve: ¿Esas asignaciones de roles hacen con sentido?

source: Don't forget to rerun buildout!
es_ve: ¡No olvide volver a ejecutar buildout!

source: Don't worry about getting it perfect or asking for help; this way you get to know us and we improve our code together as a community.
es_ve: No se preocupe por hacerlo perfecto o pedir ayuda, de esta manera usted se llega a hacernos saber a nosotros como mejorar nuestro código juntos como una comunidad.

source: Don’t let the wording freak you out: signing the agreement is easy and you will get access almost immediately.
es_ve: No deje que la redacción le asuste: la firma del acuerdo es fácil y usted tendrá acceso casi inmediato.

source: Download an IRC client and jump on to #plone-framework (and/or #plone - both on freenode).
es_ve: Descargue un software de cliente IRC y entre dentro de la sala IRC #plone-framework (y / o en la sala #plone - ambos en el servidor freenode).

source: During the merge phase you must be prepared to help out with all the features and bugs that arise.
es_ve: Durante la fase de fusión debe estar preparado para ayudar con todas las características y fallos que puedan surgir.

source: Edit ~/.subversion/config and add eggtest*.egg to the list of global-ignores
es_ve: Editar el archivo ~/.subversion/config y añadir eggtest*.egg a la lista de global-ignores

source: Either way it's your call.
es_ve: De cualquier forma, es tu decisión.

source: Errors Running bootstrap.py ^^^^^^^^^^^^^^^^^^^^^^^^^^^ You may not even get to running buildout and then you will already have an error.
es_ve: Errores ejecutando bootstrap.py ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Ni siquiera se puede llegar a correr buildout y entonces ya tendrá un error.

source: Evaluating PLIPs ^^^^^^^^^^^^^^^^ After you submit your PLIP, the Framework Team will meet within a couple weeks and let you know if the PLIP is accepted.
es_ve: Evaluando PLIPs ^^^^^^^^^^^^^^^ Después de presentar su PLIP, el equipo Framework tendrá un par de semanas para conocer y le harán de conocimiento si el PLIP es aceptado.

source: Everything about this process would be the same except you need to work on a branch.
es_ve: Todo acerca de este proceso sería el mismo, excepto que necesita para trabajar en una branch.

source: Everything else should be self explanatory.
es_ve: Todo lo demás debe explicarse por sí mismo en el ticket de su PLIP.

source: Example PLIP Reviews ^^^^^^^^^^^^^^^^^^^^
es_ve: Ejemplos de revisiones de PLIP ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

source: Expectations ------------ A good PLIP review takes about 4 hours so please plan accordingly.
es_ve: Expectativas ------------ Una buena revisión del PLIP toma aproximadamente 4 horas así que por favor haga planes en consecuencia.

source: Fear not!
es_ve: ¡No tema!

source: File Conventions ---------------- In Zope 2, file names used to be MixedCase.
es_ve: Convenciones de Archivo ----------------------- En Zope 2, los nombres de archivos que solía ser así MixedCase.

source: Filenames should be short and descriptive.
es_ve: Los nombres de archivos debe ser ordenados y descriptivos.

source: Finalizing Tickets ------------------ If you are working from a ticket, please don't forget to go back to the ticket and add a link to the changeset.
es_ve: Finalizando Tickets ------------------- Si usted esta trabajando de un ticket asignado, por favor no olvide en volver a actualizar el ticket y agregar un enlace a sus revisión de cambios.

source: Finishing Up ^^^^^^^^^^^^ Before marking your PLIP as ready for review, please add a file to give a set of instructions to the PLIP reviewer.
es_ve: Finalizando ^^^^^^^^^^^ Antes de hacer que su PLIP este listo para revisar, por favor añada un archivo dando un conjunto de instrucciones al revisor PLIP.

source: First and foremost, you'll see that there are several branches.
es_ve: Primero y mas importante, puede ver que este paquete tiene varias branches.

source: First check out the branch::
es_ve: Primero cambie a la branch::

source: First, please edit CHANGES.rst (or CHANGES.txt) in each pakage you have modified and add a summary of the change.
es_ve: Primero, por favor edite el archivo CHANGES.rst (o CHANGES.txt) en cada archivo que usted modifico y agregue un resumen de sus cambios en base al formato que usa este archivo.

source: First, please join the `plone-developers <https://lists.sourceforge.net/lists/listinfo/Plone-developers>`_ list and at minimum lurk around.
es_ve: En primer lugar, por favor, únase a la lista de correo de desarrolladores de Plone `plone-developers <https://lists.sourceforge.net/lists/listinfo/Plone-developers>`_ y, como mínimo, estar al acecho alrededor de esta lista.

source: First, you can force buildout to run with the version you already have installed by invoking the version tag.
es_ve: En primer lugar, puede hacer que se ejecute buildout con la versión que ya se han instalado mediante la invocación de la etiqueta de versión.

source: Fix ~~~
es_ve: Solución ~~~~~~~~

source: Fix ~~~ mr.developer is complaining because a file has been changed/added, but not committed.
es_ve: Solución ~~~~~~~~ mr.developer se queja porque un archivo se ha cambiado / añadido, pero no se ha generado una revisión.

source: For Plone core packages, this includes ``LICENSE.txt`` and ``LICENSE.GPL``.
es_ve: Para paquetes del núcleo Plone, esto incluye ``LICENSE.txt`` Y ``LICENSE.GPL`.

source: For example, if the issue is in plone.app.caching and plone.caching::
es_ve: Por ejemplo, si la incidencia es en los paquetes plone.app.caching y plone.caching::

source: For example, if there is control panel configuration, does the new form fit in with the rest of the panels?
es_ve: Por ejemplo, si hay configuración de panel del control, hacer esta forma nueva funciona en con el resto de los panel de control.

source: For example, instead of using 'context.plone_utils', use::
es_ve: Por ejemplo, en vez de utilizar g 'context.plone_utils', use::

source: For more information on buildout, please see the `collective developer manual documentation on buildout <http://collective-docs.plone.org/en/latest/tutorials/buildout/index.html>`_.
es_ve: Para mas información sobre buildout, por favor ver la `documentación sobre buildout en el manual de desarrollador collective <http://collective-docs.plone.org/en/latest/tutorials/buildout/index.html>`_.

source: For more information on writing PLIPS, please :doc:`go here <plips>`.
es_ve: Para más información en la escritura de PLIPS, por favor :doc:`valla aqui <plips>`.

source: For more information, please see http://plone.org/tuneup.
es_ve: Para más información, por favor ver http://plone.org/tuneup.

source: For questions about why the agreement is required, please see http://plone.org/foundation/contributors-agreement.
es_ve: Para preguntas acerca de por qué el acuerdo está requerido, por favor ver http://plone.org/foundation/contributors-agreement.

source: For some more tips on working with mr.developer, please :doc:`read more here <mrdeveloper>`.
es_ve: Para algunos más consejos en la forma de trabajo con mr.developer, por favor :doc:`lea mas aquí <mrdeveloper>`.

source: Framework Team reviews plip and givea feedback #.
es_ve: El equipo del Framework revisa el plip y ofrece un comentario #.

source: From then on you can just do::
es_ve: A partir de entonces sólo se puede hacer::

source: From time to time you can check if some old cruft has accumulated:
es_ve: De vez en cuando puedes comprobar si alguna cosas pendiente:

source: Functionality Review -------------------- There are several things that could be addressed in a PLIP review depending on the nature of the PLIP itself.
es_ve: Revisión de funcionalidad ------------------------- Hay varias cosas que podría ser dirigido en una revisión PLIP que depende de la naturaleza del PLIP.

source: General Rules ^^^^^^^^^^^^^
es_ve: Reglas Generales ^^^^^^^^^^^^^^^^

source: Give it a descriptive name, starting with the plip number; 'plip-1234-widget-frobbing.cfg' for example.
es_ve: Dar un nombre descriptivo, iniciando con el numero de plip; por ejemplo 'plip-1234-widget-frobbing.cfg'.

source: HOWEVER, there are a few situations where a branch is appropriate.
es_ve: NO OBSTANTE, hay unas cuantas situaciones donde una hacer un nuevo branch es apropiado.

source: Hang in there!
es_ve: ¡Aguante ahí!

source: Has the implementor addressed them if so?
es_ve: ¿El implementador de este PLIP se dirigió a ellos si es así?

source: Have a beer and head over to the `Jenkins control panel <https://jenkins.plone.org/>`_.
es_ve: Ten una cerveza y tu mirada sobre el `panel de control Jenkins <https://jenkins.plone.org/>`_.

source: Historically the code is all camel case, but many new libraries are in the PEP8 convention.
es_ve: Históricamente, el código es todo camel case, pero muchas nuevas bibliotecas se encuentran en la convención PEP8.

source: Hooray!
es_ve: ¡Hurra!

source: How To Commit Fixes to Plone Core ================================= This document assumes you want to fix a bug and will detail the full process.
es_ve: Como presentar corrección de fallos al núcleo de Plone ====================================================== Este documento supone que usted quiere corregir un fallo y detallará el proceso completo para hacerlo.

source: How about a last minute checklist:
es_ve: Verifique su lista de actividades hechas en los últimos minutos:

source: How about strings in date fields or nulls in required?
es_ve: ¿Cómo son las cadenas en los campos de fecha o los campos nulos son requeridos?

source: How to Submit a PLIP -------------------- Whether you want to update the default theme or rip out a piece of architecture, everyone should go through the PLIP process.
es_ve: Como presentar a PLIP --------------------

source: How to Update these Docs ========================
es_ve: Cómo actualizar estas documentaciones =====================================

source: However, chances are the bug is in multiple branches.
es_ve: Sin embargo, si la corrección del fallo es en múltiples branches.

source: I personally know that versions 1.4.4, 1.5.1, and 1.5.2 all work this way.
es_ve: Yo conozco personalmente que las versiones 1.4.4, 1.5.1, 1.5.2 y todo funciona de esta manera.

source: I prefer branching, and I'm writing the docs so this uses the branch method.
es_ve: Yo prefiero hacer branch, y yo estoy escribiendo la documentación en esto usando el método de branch.

source: I'm betting on the latter.
es_ve: Estoy apostando a este último.

source: If a change was related to a bug in the issue tracker, the changelog entry should include a link to that issue.
es_ve: Si un cambio sucedió relacionado a un error en el sistema de ticket, en la entrada changelog tendría que incluir un enlace a aquel asunto.

source: If all went as planned the next Plone release will carry on with your PLIP in it.
es_ve: Si todo ha ido según lo previsto en el próximo lanzamiento de Plone contendrá su PLIP en ella.

source: If buildout ends with warning you that some packages could not be downloaded, then chances are that package wasn't downloaded.
es_ve: Si buildout termina con un aviso de que algunos paquetes no se pudo descargar, entonces es probable que el paquete no se ha descargado.

source: If the PLIP is not accepted, please don't be sad!
es_ve: Si el PLIP no es aceptado, por favor, se sienta mal!

source: If the bug is really bad, consider pinging the release manager and asking him to make a release pronto.
es_ve: Si el fallo es realmente mala, considere en contactar al release manager y he invitarle a hacer un pronto lanzamiento.

source: If the codebase is written with docstrings, API documentation can be automatically generated using Sphinx.
es_ve: Si el código base está escrito con docstrings, la documentación de la API puede ser automáticamente generada utilizando Sphinx.

source: If the fix is only for one version, make sure to get that branch and party on.
es_ve: Si la corrección es solamente para una versión, asegúrese de obtener la branch y aplicar sus cambios allí.

source: If this prints any lines with a question mark in front, you can cleanup by:
es_ve: Si esto imprime alguna líneas con un signo de interrogación delante, usted puede limpiarlo con:

source: If you answered YES to all of these questions, you are ready to push your changes!
es_ve: Si usted respondió SI a todas estas preguntas, usted esta listo para presentar sus cambios!

source: If you are at a sprint, you will likely just hand this paper to the sprint
es_ve: Si usted esta en un sprint, probablemente solo debe entregar este papel al sprint

source: If you are fixing three bugs, make three commits.
es_ve: Si usted esta corrigiendo tres fallas, haga tres revisiones.

source: If you are going to be contributing back to Plone, we ask a couple things.
es_ve: Si usted va a contribuir algo a Plone, pedimos un par de cosas.

source: If you are in a timezone when things are not very active, please post to the plone-developers mailing list or grab a beer and wait for people to wake up.
es_ve: Tenga en cuenta que usted esta en una zona horaria y cuándo necesita hacer preguntas en el canal IRC y las cosas no están muy activas, por favor, escribir un mensaje a la lista de correo plone-developers o tome una cerveza y relájese, espere a que la gente se despierte.

source: If you are not familiar with `PEP 8 <http://www.python.org/dev/peps/pep-0008>`_ - the python style guide, please take a moment to read and get up to date.
es_ve: Si no estas familiarizado con `PEP 8 <http://www.python.org/dev/peps/pep-0008>`_ - la guía de estilo de la python, por favor, tome un momento para leer y ponerse al día.

source: If you are not logged in, you will not be able to select a component so make sure you are logged in.
es_ve: Si usted no esta iniciado en su sesión de usuario, no será capaz de seleccionar un componente.

source: If you aren't sure where to start or just want more direction, feel free to get on IRC, mailing lists, Twitter, etc... and ask for help.
es_ve: Si no eres seguro por dónde para empezar o justo querer más dirección, siente libre de usar el IRC, las listas de correo, Twitter, etc... Y pedir ayuda.

source: If you branch, it helps us because we *know* that you have committer rights.
es_ve: Si usted hace un branch, nos ayudo porque nosotros *sabemos* que tienes permisos para aplicar revisiones a este branch.

source: If you commit something REALLY sketchy, they will politely contact you, most likely after immediately reverting changes.
es_ve: Si su revisión tiene algo REALMENTE sketchy, ellos le contactaran políticamente a usted, lo mas común que suceda es que inmediatamente revierten los cambios aplicados con sus revisiones.

source: If you do not have access, please attach your review to the PLIP ticket itself.
es_ve: Si no tienes acceso, por favor adjuntar su revisión al ticket PLIP en si mismo.

source: If you do this, your ``README.rst`` must link off site to the documentation.
es_ve: Si tú hace esto, su ``README.rst`` debe que enlazar fuera sitio a la documentación.

source: If you don't start with a test case, save yourself potential problems and validate the bug before getting too deep into the issue!
es_ve: ¡Si usted no comienza con un caso de prueba, se ahorrará problemas potenciales y validar el fallo antes de llegar demasiado profundo en la incidencia!

source: If you find this is the case and your PLIP is anything more than trivial, maybe some more vetting should be done.
es_ve: Si usted busca esto es el caso y su PLIP no tiene más nada que un cambio trivial, quizás con algo más investigación debería estar listo.

source: If you have ideas on new interactions or UI your ideas are more than welcome.
es_ve: Si usted tiene ideas sobre nuevas formas de interactuar o de la interfaz de usuario sus ideas son mas que bienvenidas.

source: If you have several python installs and want to switch which python is tied to your buildout, simply rerun bootstrap.py with the new python (and then rerun buildout).
es_ve: Si tiene varias instalaciones Python y quiere cambiar a cual Python está asociando a su buildout, sólo tiene que volver a ejecutar bootstrap.py con el nuevo python (y vuelva a ejecutar el buildout).
